#coding:utf-8
import msgpack
from food_mgr import FoodMgr
mgr = FoodMgr('jun')

#20元",配送费¥5",",",",",菜",

#菜
store = '大鸭梨烤鸭'
discounts=[]
discounts.append({'full':45, 'sub':13})
discounts.append({'full': 80, 'sub':21})
store_info = {'travelling': 8, 'min_cost': 20, 'discounts': discounts}
mgr.redis_server.hset('stores', store, msgpack.packb(store_info))

a = ["小份水煮肉","29","小份千页豆腐","18.9","小份长豆角烧茄子","18.9","小份酸辣土豆丝","16","酸菜鱼（小份）","49","单人烤鸭","46","双椒炒鸡蛋","26","梅干菜炒四季豆","18.9","老北京炸酱面","16","蒜蓉粉丝蒸虾","39","精品酸菜鱼","88","干炸丸子","46","青椒猪肚鸡","68","卤耳炒香干","42","石锅千叶豆腐","43","水煮猪肉","46","水煮牛肉","56","啤酒喂肥肠","68","石锅酥骨凤爪","56","大碗有机花菜","36","松仁玉米","32","蒜蓉粉丝娃娃菜","26","毛笋尖炒酸菜","29","丸子烧白菜","38","醋溜木须","48","酸辣土豆丝","19","白灼芥兰","32","白灼秋葵","32","木耳山药","32","钵子淮山药","36","白菜粉丝炖鸭架","22","青椒鸡蛋豆腐","29","钵子粉丝包菜","29","梅菜扣肉","46","贝勒爷烤肉","68","京酱肉丝","39","宫保鸡丁","32","鱼香肉丝","32","酱爆鸡丁","49","金汤江南脆笋","56","海鲜毛血旺","78","馋嘴牛蛙","88","老佛爷爱吃豆腐","56","鸭梨全家福","68","柴鸡蛋煮小白菜","32","川式铂钵鸡","42","小炒肉","36","快乐的憨豆","29","鲜紫苏牛蛙","78","石锅豆腐鱼","48"]

for i in range(0, len(a)):
	if i%2 == 1:
		mgr.create(store, a[i-1], float(a[i]), '菜')

#汤
a = ["山药炖排骨","58","酸辣汤","20","老胡同疙瘩汤","28"]
for i in range(0, len(a)):
	if i%2 == 1:
		mgr.create(store, a[i-1], float(a[i]), '汤')

#凉菜
a = ["鸭梨大拌菜","29","东北大拉皮","22","酱香鸭头","4","蟹黄豆腐","42","江南藕粉面","26","红豆煮菜心","28","小鱼花生","16","不一般皮蛋豆腐","26","茶香干野菜","29","蜜汁莲藕","32","蓝莓山药","36","川味香肠","39"]
for i in range(0, len(a)):
	if i%2 == 1:
		mgr.create(store, a[i-1], float(a[i]), '凉菜')

#"主食",
a = ["猪肉大葱水饺","32","米饭","4","金鸭梨","5","小笼米粉肉","42","炒河粉","12.8","白馒头","2","酱油炒饭","26","韭菜鸡蛋水饺","29","开花馒头","6"]
for i in range(0, len(a)):
	if i%2 == 1:
		mgr.create(store, a[i-1], float(a[i]), '主食')

#"饮"
a=["小可乐","6","小雪碧","6","加多宝","8","梨汤","9.9","蓝莓汁","9.9"]
for i in range(0, len(a)):
	if i%2 == 1:
		mgr.create(store, a[i-1], float(a[i]), '饮')
mgr.load()
mgr.echo()
